/* eslint-disable jsx-a11y/anchor-is-valid */
import React from "react";
// import FollowUpPollCard from "./FollowUpPollCard";
// import Button from "../../../duplicateComponents/Button";
import PopupDone from "../../../duplicateComponents/PopupDone";
import TableContainer from "../../../duplicateComponents/TableContainer";
import FollowUpPollCardTest from "./FollowUpPollCardTest";
import Button from "../../../duplicateComponents/Button";

const FollowUpPollCardStudentContainer = () => {
  const myDataPollStudent = [
    {
      title: "سمعت كثيراً عن برنامج التدريب التعاوني قبل بدايته",
    },
    {
      title: "دورة التهيئة لبرنامج التدريب التعاوني كانت واضحة الأهداف",
    },
    {
      title:
        "تم تعريفنا ببرامج تطويرية للتدريب التعاوني تساهم في توظيفنا قبل بداية التدريب التعاوني",
    },
    {
      title:
        "دورة تهيئة المتدرب للتدريب التعاوني كانت مميزة وتجيب على مايدور لدينا من أسئلة",
    },
    {
      title:
        "أعتقد أن الفرصة التي يحصل عليها المتدرب بنفسه تساعده كثيراً على الإنتاجية والتوظيف",
    },
    {
      title:
        "كنت متشوقاً لبرنامج التدريب التعاوني لأنه ينقلنا لمرحلة التطبيق الميداني",
    },
    {
      title: "ربطت بين التدريب التعاوني وبين حصولي على الوظيفة",
    },
    {
      title: "برنامج التدريب التعاوني شيق ومفيد",
    },
    {
      title: "برنامج التدريب التعاوني شجعني على حب التفوق",
    },
    {
      title:
        "ما وزع علينا من حول برنامج التدريب التعاوني من أدلة كتيبات تعريف كان كافياً",
    },
    {
      title:
        "خطة التدريب التعاوني كانت واضحة جداً فلدينا معرفة بما يجب عمله في المنشأة التدريبية كل أسبوع",
    },
    {
      title:
        "هناك توافق كبير بين مجال التخصص الذي تخرجت منه وطبيعة فرصة التدريب التعاوني التي حصلت عليها",
    },
    {
      title: "استقبال منشأة التدريب التعاوني كان مميزاً",
    },
    {
      title:
        "توقعت على أن أحصل على مكافأة مجزية نهاية التدريب التعاوني من المنشأة",
    },
    {
      title: "حاولت أن أبحث عن فرصة لي في التدريب التعاوني",
    },
    {
      title:
        "زيارات مشرف التدريب التعاوني كانت كافية للوقوف على مسيرتي في برنامج التدريب التعاوني",
    },
    {
      title:
        "من الضروري التواصل عن طريق الجوال بين المشرف من الكلية / المعهد والمتدرب",
    },
    {
      title:
        "من المهم أن يعرف المتدرب عن وقت زيارة المشرف من الكلية / المعهد له",
    },
    {
      title:
        "أهتمام مشرف جهة التدريب (المنشأة) بي وإعطائي الحافز للتدريب كان مميزاً",
    },
    {
      title:
        "بعد جهة التدريب عن منزلي كان عائق لعملية إنتظامي في التدريب التعاوني",
    },
    {
      title: "لاحظت أن الأعمال التي تسند لي متكررة ورتينية وتخالف خطة التدريب",
    },
    {
      title:
        "فترة التدريب كانت كافية لتطبيق المهارات التي حصلنا عليها في الكلية / المعهد",
    },
    {
      title:
        "من وجهة نظري ان الحضور والإنصراف هما أهم عنصرين في عملية تقييم المتدرب",
    },
    {
      title: "درجات التقييم في مصلحة المتدرب وتعطيه حقه",
    },
    {
      title: "التقارير الدورية ساعدت كثيراً في إتمام التقرير الفني",
    },
    {
      title:
        "أتمنى أن يتابع مشرف التدريب التعاوني من الكلية / المعهد عملية توظيفي لدى المنشأة لأن هذا هو الهدف الذي أسعى لتحقيقه",
    },
    {
      title: "تقييم مشرف المنشأة لي كان عادلاً وأعطاني حقي",
    },
    {
      title:
        "أرى أن إثبات الوجود في بداية فترة التوظيف أهم من الراتب الذي قد يكون منخفضاً في البداية ",
    },
    {
      title:
        "نميت مهارات إضافية بعد برنامج التدريب التعاوني غير التي تدربت عليها في الكلية / المعهد",
    },
    {
      title:
        "اطلعت على جميع نماذج التقييم التي تخصني أثناء برنامج التدريب التعاوني",
    },
    {
      title:
        "تقييم مشرف التدريب التعاوني في الكلية / المعهد كان عادلاً وأعطاني ما أستحق",
    },
  ];

  return (
    <div className="mt-5 rounded-3 ">
      <TableContainer
        thead={["#", "البنود", "1", "2", "3", "4", "5"]}
        item={
          <>
            {myDataPollStudent.map((item, i) => (
              <FollowUpPollCardTest key={i} index={i + 1} title={item.title} />
            ))}
          </>
        }
      />
      <div className="col-12 col-md-6 col-lg-5 col-xl-4  p-2 mt-4 m-auto">
        <Button
          title={"إرسال"}
          type={"button"}
          dataBsToggle={"modal"}
          dataBsTarget={"#exampleModalPollDone"}
        />
      </div>
      <PopupDone
        id={"exampleModalPollDone"}
        title={"تم استطلاع رأيك"}
        icon={"../../images/send.gif"}
        subTitle={
          "شكراً لك على استطلاع رأيك في التدريب العاوني ونتمنى انك استمتعت في رحلة التدريب"
        }
      />
    </div>
  );
};

export default FollowUpPollCardStudentContainer;
